# Length Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
HostedSweep..::..Length Property
HostedSweep Class See Also
---
Retrieve the length of the hosted sweep object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Length { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Length As Double
	Get
```

Visual C++
---
```text
public:
property double Length {
	double get ();
}
```

# See Also
HostedSweep Class
Autodesk.Revit.DB Namespace